// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "我亲爱的姐姐",  // 同上...
        "祝你生日快乐哦！",
        "愿你此后每一天",
        "眼里是阳光",
        "笑里是坦荡",
        "平平安安",
        "健健康康！",
        "开开心心",
        "心想事成",
        "从此不在有烦恼",
        "希望你可以",
        "像孩子一样快乐",
        "像星星一样努力发光",
        "像风一样自由",
        "越来越女神",
        "所有心愿都能实现",
        "永远年轻",
        "永远美丽",
        "永远幸福开心~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "我亲爱的姐姐": "./imgs/1.png",
        "愿你此后每一天": "./imgs/2.png",
        "笑里是坦荡": "./imgs/3.png",
        "健健康康！": "./imgs/4.png",
        "心想事成": "./imgs/5.png",
        "像孩子一样快乐": "./imgs/6.png",
        "像星星一样努力发光": "./imgs/7.png",
        "像风一样自由": "./imgs/8.png",
        "越来越女神": "./imgs/9.png",
        "所有心愿都能实现": "./imgs/10.png",
        "永远年轻": "./imgs/11.png",
        "永远美丽": "./imgs/12.png",
        "永远幸福开心~": "./imgs/13.png",
        
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "start",
        play: "music",
        bannar_coming: "others",
        balloons_flying: "好像少点东西",
        cake_fadein: "Cake?",
        light_candle: "Candle?",
        wish_message: "Happy Birthday",
        story: "A MESSAGE FOR YOU",
    }
};
